CSI API ETABS v1
cCaseStaticNonlinear.GetLoadApplication Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetLoadApplication(
	string Name,
	ref int LoadControl,
	ref int DispType,
	ref double Displ,
	ref int Monitor,
	ref int DOF,
	ref string PointName,
	ref string GDispl
)
Function GetLoadApplication (
	Name As String,
	ByRef LoadControl As Integer,
	ByRef DispType As Integer,
	ByRef Displ As Double,
	ByRef Monitor As Integer,
	ByRef DOF As Integer,
	ByRef PointName As String,
	ByRef GDispl As String
) As Integer
Dim instance As cCaseStaticNonlinear
Dim Name As String
Dim LoadControl As Integer
Dim DispType As Integer
Dim Displ As Double
Dim Monitor As Integer
Dim DOF As Integer
Dim PointName As String
Dim GDispl As String
Dim returnValue As Integer
returnValue = instance.GetLoadApplication(Name,
	LoadControl, DispType, Displ, Monitor,
	DOF, PointName, GDispl)
int GetLoadApplication(
	String^ Name,
	int% LoadControl,
	int% DispType,
	double% Displ,
	int% Monitor,
	int% DOF,
	String^% PointName,
	String^% GDispl
)
abstract GetLoadApplication :
        Name : string *
        LoadControl : int byref *
        DispType : int byref *
        Displ : float byref *
        Monitor : int byref *
        DOF : int byref *
        PointName : string byref *
        GDispl : string byref -> int
Parameters
Name
Type: System.String
LoadControl
Type: System.Int32
DispType
Type: System.Int32
Displ
Type: System.Double
Monitor
Type: System.Int32
DOF
Type: System.Int32
PointName
Type: System.String
GDispl
Type: System.String
Return Value
Type: Int32
See Also
Reference
cCaseStaticNonlinear Interface
ETABSv1 Namespace